feaser/openblt/Target/Source/ARMCM33_STM32U5/flash.c
/************************************************************************************//**
* \file         Source/ARMCM33_STM32U5/flash.c
* \brief        Bootloader flash driver source file.
* \ingroup      Target_ARMCM33_STM32U5
* \internal
*----------------------------------------------------------------------------------------
*                          C O P Y R I G H T
*----------------------------------------------------------------------------------------
*   Copyright (c) 2023  by Feaser    http://www.feaser.com    All rights reserved
*
*----------------------------------------------------------------------------------------
*                            L I C E N S E
*----------------------------------------------------------------------------------------
* This file is part of OpenBLT. OpenBLT is free software: you can redistribute it and/or
* modify it under the terms of the GNU General Public License as published by the Free
* Software Foundation, either version 3 of the License, or (at your option) any later
* version.
*
* OpenBLT is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
* without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR
* PURPOSE. See the GNU General Public License for more details.
*
* You have received a copy of the GNU General Public License along with OpenBLT. It
* should be located in ".\Doc\license.html". If not, contact Feaser to obtain a copy.
*
* \endinternal
****************************************************************************************/

/****************************************************************************************
* Include files
****************************************************************************************/
#include "boot.h"                                /* bootloader generic header          */
#include "stm32u5xx.h"                           /* STM32 CPU and HAL header           */
#include "stm32u5xx_ll_icache.h"                 /* STM32 LL internal cache header     */


/****************************************************************************************
* Macro definitions
****************************************************************************************/
/** \brief Value for an invalid sector entry index into flashLayout[]. */
#define FLASH_INVALID_SECTOR_IDX        (0xff)
/** \brief Value for an invalid flash address. */
#define FLASH_INVALID_ADDRESS           (0xffffffff)
/** \brief Standard size of a flash block for writing. */
#define FLASH_WRITE_BLOCK_SIZE          (1024)
/** \brief Total numbers of sectors in array flashLayout[]. */
#define FLASH_TOTAL_SECTORS             (sizeof(flashLayout)/sizeof(flashLayout[0]))
/** \brief End address of the bootloader programmable flash. */
#define FLASH_END_ADDRESS               (flashLayout[FLASH_TOTAL_SECTORS-1].sector_start + \
                                         flashLayout[FLASH_TOTAL_SECTORS-1].sector_size - 1)
#ifndef BOOT_FLASH_VECTOR_TABLE_CS_OFFSET
/** \brief Offset into the user program's vector table where the checksum is located. 
 *         For this target it is set to the end of the vector table. Note that the 
 *         value can be overriden in blt_conf.h, because the size of the vector table
 *         could vary. When changing this value, don't forget to update the location
 *         of the checksum in the user program accordingly. Otherwise the checksum
 *         verification will always fail.
 */
#define BOOT_FLASH_VECTOR_TABLE_CS_OFFSET    (0x234)
#endif


/****************************************************************************************
* Plausibility checks
****************************************************************************************/
#if (BOOT_FLASH_VECTOR_TABLE_CS_OFFSET >= FLASH_WRITE_BLOCK_SIZE)
#error "BOOT_FLASH_VECTOR_TABLE_CS_OFFSET is set too high. It must be located in the first writable block."
#endif

#ifndef BOOT_FLASH_CUSTOM_LAYOUT_ENABLE
#define BOOT_FLASH_CUSTOM_LAYOUT_ENABLE (0u)
#endif


/****************************************************************************************
* Type definitions
****************************************************************************************/
/** \brief Flash sector descriptor type. */
typedef struct
{
  blt_addr   sector_start;                       /**< sector start address             */
  blt_int32u sector_size;                        /**< sector size in bytes             */
} tFlashSector;

/** \brief    Structure type for grouping flash block information.
 *  \details  Programming is done per block of max FLASH_WRITE_BLOCK_SIZE. for this a
 *            flash block manager is implemented in this driver. this flash block manager
 *            depends on this flash block info structure. It holds the base address of
 *            the flash block and the data that should be programmed into the flash
 *            block. The .base_addr must be a multiple of FLASH_WRITE_BLOCK_SIZE.
 */
typedef struct
{
  blt_addr  base_addr;
  blt_int8u data[FLASH_WRITE_BLOCK_SIZE];
} tFlashBlockInfo;


/****************************************************************************************
* Hook functions
****************************************************************************************/
#if (BOOT_FLASH_CRYPTO_HOOKS_ENABLE > 0)
extern blt_bool FlashCryptoDecryptDataHook(blt_addr address, blt_int8u * data, 
                                           blt_int32u size);
#endif


/****************************************************************************************
* Function prototypes
****************************************************************************************/
static blt_bool  FlashInitBlock(tFlashBlockInfo *block, blt_addr address);
static tFlashBlockInfo *FlashSwitchBlock(tFlashBlockInfo *block, blt_addr base_addr);
static blt_bool  FlashAddToBlock(tFlashBlockInfo *block, blt_addr address,
                                 blt_int8u *data, blt_int32u len);
static blt_bool  FlashWriteBlock(tFlashBlockInfo *block);
static blt_bool  FlashEmptyCheckSector(blt_int8u sector_idx);
static blt_bool  FlashEraseSectors(blt_int8u first_sector_idx, 
                                   blt_int8u last_sector_idx);
static blt_int8u FlashGetSectorIdx(blt_addr address);
static blt_int32u FlashGetBank(blt_addr address);
static blt_int32u FlashGetPage(blt_addr address);


/****************************************************************************************
* Local constant declarations
****************************************************************************************/
/** \brief   If desired, it is possible to set BOOT_FLASH_CUSTOM_LAYOUT_ENABLE to > 0
 *           in blt_conf.h and then implement your own version of the flashLayout[] table
 *           in a source-file with the name flash_layout.c. This way you customize the
 *           flash memory size reserved for the bootloader, without having to modify
 *           the flashLayout[] table in this file directly. This file will then include
 *           flash_layout.c so there is no need to compile it additionally with your
 *           project.
 */
#if (BOOT_FLASH_CUSTOM_LAYOUT_ENABLE == 0)
/** \brief   Array wit the layout of the flash memory.
 *  \details Also controls what part of the flash memory is reserved for the bootloader.
 *           If the bootloader size changes, the reserved sectors for the bootloader
 *           might need adjustment to make sure the bootloader doesn't get overwritten.
 */
static const tFlashSector flashLayout[] =
{
  /* { 0x08000000, 0x02000 },              flash sector  0 - reserved for bootloader   */
  /* { 0x08002000, 0x02000 },              flash sector  1 - reserved for bootloader   */
  /* { 0x08004000, 0x02000 },              flash sector  2 - reserved for bootloader   */
  /* { 0x08006000, 0x02000 },              flash sector  3 - reserved for bootloader   */
  { 0x08008000, 0x02000 },              /* flash sector  4 -   8kb                     */
  { 0x0800A000, 0x02000 },              /* flash sector  5 -   8kb                     */
  { 0x0800C000, 0x02000 },              /* flash sector  6 -   8kb                     */
  { 0x0800E000, 0x02000 },              /* flash sector  7 -   8kb                     */
  { 0x08010000, 0x02000 },              /* flash sector  8 -   8kb                     */
  { 0x08012000, 0x02000 },              /* flash sector  9 -   8kb                     */
  { 0x08014000, 0x02000 },              /* flash sector 10 -   8kb                     */
  { 0x08016000, 0x02000 },              /* flash sector 11 -   8kb                     */
  { 0x08018000, 0x02000 },              /* flash sector 12 -   8kb                     */
  { 0x0801A000, 0x02000 },              /* flash sector 13 -   8kb                     */
  { 0x0801C000, 0x02000 },              /* flash sector 14 -   8kb                     */
  { 0x0801E000, 0x02000 },              /* flash sector 15 -   8kb                     */
#if (BOOT_NVM_SIZE_KB > 128)
  { 0x08020000, 0x20000 },              /* flash sector 16 - 128kb                     */
#endif
#if (BOOT_NVM_SIZE_KB > 256)
  { 0x08040000, 0x20000 },              /* flash sector 17 - 128kb                     */
  { 0x08060000, 0x20000 },              /* flash sector 18 - 128kb                     */
#endif
#if (BOOT_NVM_SIZE_KB > 512)
  { 0x08080000, 0x20000 },              /* flash sector 19 - 128kb                     */
  { 0x080A0000, 0x20000 },              /* flash sector 20 - 128kb                     */
  { 0x080C0000, 0x20000 },              /* flash sector 21 - 128kb                     */
  { 0x080E0000, 0x20000 },              /* flash sector 22 - 128kb                     */
#endif
#if (BOOT_NVM_SIZE_KB > 1024)
  { 0x08100000, 0x20000 },              /* flash sector 23 - 128kb                     */
  { 0x08120000, 0x20000 },              /* flash sector 24 - 128kb                     */
  { 0x08140000, 0x20000 },              /* flash sector 25 - 128kb                     */
  { 0x08160000, 0x20000 },              /* flash sector 26 - 128kb                     */
  { 0x08180000, 0x20000 },              /* flash sector 27 - 128kb                     */
  { 0x081A0000, 0x20000 },              /* flash sector 28 - 128kb                     */
  { 0x081C0000, 0x20000 },              /* flash sector 29 - 128kb                     */
  { 0x081E0000, 0x20000 },              /* flash sector 30 - 128kb                     */
#endif
#if (BOOT_NVM_SIZE_KB > 2048)
  { 0x08200000, 0x20000 },              /* flash sector 31 - 128kb                     */
  { 0x08220000, 0x20000 },              /* flash sector 32 - 128kb                     */
  { 0x08240000, 0x20000 },              /* flash sector 33 - 128kb                     */
  { 0x08260000, 0x20000 },              /* flash sector 34 - 128kb                     */
  { 0x08280000, 0x20000 },              /* flash sector 35 - 128kb                     */
  { 0x082A0000, 0x20000 },              /* flash sector 36 - 128kb                     */
  { 0x082C0000, 0x20000 },              /* flash sector 37 - 128kb                     */
  { 0x082E0000, 0x20000 },              /* flash sector 38 - 128kb                     */
  { 0x08300000, 0x20000 },              /* flash sector 39 - 128kb                     */
  { 0x08320000, 0x20000 },              /* flash sector 40 - 128kb                     */
  { 0x08340000, 0x20000 },              /* flash sector 41 - 128kb                     */
  { 0x08360000, 0x20000 },              /* flash sector 42 - 128kb                     */
  { 0x08380000, 0x20000 },              /* flash sector 43 - 128kb                     */
  { 0x083A0000, 0x20000 },              /* flash sector 44 - 128kb                     */
  { 0x083C0000, 0x20000 },              /* flash sector 45 - 128kb                     */
  { 0x083E0000, 0x20000 },              /* flash sector 46 - 128kb                     */
#endif
#if (BOOT_NVM_SIZE_KB > 4096)
#error "BOOT_NVM_SIZE_KB > 4096 is currently not supported."
#endif
};
#else
#include "flash_layout.c"
#endif /* BOOT_FLASH_CUSTOM_LAYOUT_ENABLE == 0 */


/****************************************************************************************
* Local data declarations
****************************************************************************************/
/** \brief   Local variable with information about the flash block that is currently
 *           being operated on.
 *  \details The smallest amount of flash that can be programmed is
 *           FLASH_WRITE_BLOCK_SIZE. A flash block manager is implemented in this driver
 *           and stores info in this variable. Whenever new data should be flashed, it
 *           is first added to a RAM buffer, which is part of this variable. Whenever
 *           the RAM buffer, which has the size of a flash block, is full or  data needs
 *           to be written to a different block, the contents of the RAM buffer are
 *           programmed to flash. The flash block manager requires some software
 *           overhead, yet results is faster flash programming because data is first
 *           harvested, ideally until there is enough to program an entire flash block,
 *           before the flash device is actually operated on.
 */
static tFlashBlockInfo blockInfo;

