feaser/openblt/Target/Source/ARMCM33_STM32U5/flash.c
#if (BOOT_FLASH_CRYPTO_HOOKS_ENABLE > 0)
  #if (BOOT_NVM_CHECKSUM_HOOKS_ENABLE == 0)
  /* note that the bootblock is already decrypted in FlashWriteChecksum(), if the
   * internal checksum mechanism is used. Therefore don't decrypt it again.
   */
  if (block != &bootBlockInfo)
  #endif
  {
    /* perform decryption of the program data before writing it to flash memory. */
    if (FlashCryptoDecryptDataHook(block->base_addr, block->data, 
                                   FLASH_WRITE_BLOCK_SIZE) == BLT_FALSE)
    {
      result = BLT_FALSE;
    }
  }
#endif

  /* only continue with programming if all is okay so far */
  if (result == BLT_TRUE)
  {
    /* unlock the flash peripheral to enable the flash control register access */
    HAL_FLASH_Unlock();

    /* program all quad words (128 bits = 16 bytes) in the block one by one */
    for (qword_cnt=0; qword_cnt<(FLASH_WRITE_BLOCK_SIZE/qword_byte_num); qword_cnt++)
    {
      /* calculate the destination address in flash of this quad word */
      prog_addr = block->base_addr + (qword_cnt * qword_byte_num);
      /* set the base address in ram that holds the data to program */
      data_addr = (blt_int32u)(&block->data[qword_cnt * qword_byte_num]);
      /* keep the watchdog happy */
      CopService();
      /* program the quad word data at 'data_addr' to memory address 'prog_addr' */
      if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_QUADWORD, prog_addr, data_addr) != HAL_OK)
      {
        result = BLT_FALSE;
        break;
      }
    }

    /* lock the flash peripheral to disable the flash control register access */
    HAL_FLASH_Lock();
  }

  /* only continue with verification if all is okay so far */
  if (result == BLT_TRUE)
  {
    /* keep the watchdog happy */
    CopService();
    /* verify all words in the block one by one */
    for (word_cnt=0; word_cnt<(FLASH_WRITE_BLOCK_SIZE/sizeof(blt_int32u)); word_cnt++)
    {
      word_addr = block->base_addr + (word_cnt * sizeof(blt_int32u));
      word_data = *(volatile blt_int32u *)(&block->data[word_cnt * sizeof(blt_int32u)]);
      /* verify that the written data is actually there. */
      if (*(volatile blt_int32u *)word_addr != word_data)
      {
        result = BLT_FALSE;
        break;
      }
    }
  }

  /* give the result back to the caller */
  return result;
} /*** end of FlashWriteBlock ***/


/************************************************************************************//**
** \brief     Checks if the flash sector is already completely erased.
** \param     sector_idx flash sector number index into flashLayout[].
** \return    BLT_TRUE if the flash sector is already erased, BLT_FALSE otherwise.
**
****************************************************************************************/
static blt_bool FlashEmptyCheckSector(blt_int8u sector_idx)
{
  blt_bool   result = BLT_TRUE;
  blt_addr   sectorAddr;
  blt_int32u sectorSize;
  blt_int32u wordCnt;
  blt_int32u volatile const * wordPtr;

  /* retrieve sector info */
  sectorAddr = flashLayout[sector_idx].sector_start;
  sectorSize = flashLayout[sector_idx].sector_size;

  /* sanity check. sector base address should be 32-bit aligned and the size
   * should be a multiple of 32-bits.
   */
  ASSERT_RT(((sectorAddr % sizeof(blt_int32u)) == 0) &&
            ((sectorSize % sizeof(blt_int32u)) == 0));

  /* initialize the pointer to the first word in the sector */
  wordPtr = (blt_int32u volatile const *)sectorAddr;
  /* read sector 32-bits at a time */
  for (wordCnt = 0; wordCnt < (sectorSize/sizeof(blt_int32u)); wordCnt++)
  {
    /* service the watchdog every 256th loop iteration */
    if ((wordCnt % 256) == 0)
    {
      CopService();
    }
    /* word not in the erased state? */
    if (*wordPtr != 0xFFFFFFFFu)
    {
      /* sector not empty, update the result accordingly */
      result = BLT_FALSE;
      /* no point in continuing the sector empty check */
      break;
    }
    /* set pointer to the next word in the sector */
    wordPtr++;
  }
  /* give the result back to the caller. */
  return result;
} /*** end of FlashEmptyCheckSector ***/


/************************************************************************************//**
** \brief     Erases the flash sectors from indices first_sector_idx up until
**            last_sector_idx into the flashLayout[] array.
** \param     first_sector_idx First flash sector number index into flashLayout[].
** \param     last_sector_idx  Last flash sector number index into flashLayout[].
** \return    BLT_TRUE if successful, BLT_FALSE otherwise.
**
****************************************************************************************/
static blt_bool FlashEraseSectors(blt_int8u first_sector_idx, blt_int8u last_sector_idx)
{
  blt_bool               result = BLT_TRUE;
  blt_int8u              sectorIdx;
  blt_addr               sectorBaseAddr;
  blt_int32u             sectorSize;
  FLASH_EraseInitTypeDef eraseInitStruct;
  uint32_t               pageEraseError = 0;
  uint32_t               sectorBank;
  uint32_t               sectorFirstPage;
  uint32_t               sectorTotalPages;

  /* validate the sector numbers */
  if (first_sector_idx > last_sector_idx)
  {
    result = BLT_FALSE;
  }

  /* only continue if all is okay so far */
  if (result == BLT_TRUE)
  {
    if (last_sector_idx > (FLASH_TOTAL_SECTORS-1))
    {
      result = BLT_FALSE;
    }
  }

  /* only continue if all is okay so far */
  if (result == BLT_TRUE)
  {

    /* unlock the flash peripheral to enable the flash control register access. */
    HAL_FLASH_Unlock();

    /* erase the sectors one by one */
    for (sectorIdx = first_sector_idx; sectorIdx <= last_sector_idx; sectorIdx++)
    {
      /* no need to erase the sector if it is already empty */
      if (FlashEmptyCheckSector(sectorIdx) == BLT_FALSE)
      {
        /* service the watchdog */
        CopService();
        /* get information about the sector */
        sectorBaseAddr = flashLayout[sectorIdx].sector_start;
        sectorSize = flashLayout[sectorIdx].sector_size;
        /* validate the sector information */
        if ( (sectorBaseAddr == FLASH_INVALID_ADDRESS) || (sectorSize == 0) )
        {
          /* invalid sector information. flag error and abort erase operation */
          result = BLT_FALSE;
          break;
        }

        /* assert that the sector size is an exact multiple of the page size */
        ASSERT_RT((sectorSize % FLASH_PAGE_SIZE) == 0);
        /* determine how many pages the sector contains */
        sectorTotalPages = sectorSize / FLASH_PAGE_SIZE;
        /* determine the flash bank that the sector falls into */
        sectorBank = FlashGetBank(sectorBaseAddr);
        /* determine the page number of the first page in the sector */
        sectorFirstPage = FlashGetPage(sectorBaseAddr);

        /* prepare the information for the erase operation */
        eraseInitStruct.TypeErase = FLASH_TYPEERASE_PAGES;
        eraseInitStruct.Banks = sectorBank;
        eraseInitStruct.Page = sectorFirstPage;
        eraseInitStruct.NbPages = sectorTotalPages;

        /* perform the flash erase operation of the sector */
        if (HAL_FLASHEx_Erase(&eraseInitStruct, &pageEraseError) != HAL_OK)
        {
          /* could not perform erase operation */
          result = BLT_FALSE;
          /* error detected so don't bother continuing with the loop */
          break;
        }
      }
    }

    /* lock the flash peripheral to disable the flash control register access. */
    HAL_FLASH_Lock();
  }

